sedfoam-master/tutorials/RAS/1DOscill/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        kOmega;

turbulence      on;

printCoeffs     on;

kOmegaLowReCoeffs
{
    Cmu_            0.09;
    beta            0.072;
    alpha0          0.11;
    alpha0Star      0.024;
    ReK             20;
    ReBeta          27;
    ReOmega         2.95;
    alphaK          0.375;
    alphaOmega      0.8;
}

// ************************************************************************* //
