sedfoam-master/tutorials/RAS/1DOscill/constant/forceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      forceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// * * * * * * * * * * * * * following are for presure * * * * * * * * * * * * * * * //
tilt            tilt [ 0 0 0 0 0 0 0 ] 0;
gradPAMP1       gradPAMP1 [ 1 -2 -2 0 0 0 0 ] (1727.87 0 0 );     // pressure osci amp
gradPAMP2       gradPAMP2 [ 1 -2 -2 0 0 0 0 ] (0 0 0 );     // pressure osci amp
gradPMEAN       gradPMEAN        [ 1 -2 -2 0 0 0 0 ] (0 0 0 ); // mean pressure
oscpT           oscpT [ 0 0 0 0 0 0 0 ] 4.0;       // osci period
initTheta1      initTheta1 [ 0 0 0 0 0 0 0] 0;
initTheta2      initTh2eta [ 0 0 0 0 0 0 0] 0;
Cvm             Cvm [ 0 0 0 0 0 ] 0;                // Virtual/Added Mass coefficient

Cl              Cl [ 0 0 0 0 0 ] 0;                 // Lift force coefficient

Ct              Ct [ 0 0 0 0 0 ] 0;                 // Eddy diffusivity coefficient for phase a

ClipUa          ClipUa [ 0 0 0 0 0 ] 1;

debugInfo       true;

writeTau        true;
// * * * * * * * * * * * * end of definition of pressure * * * * * * * * * * * * * //
