sedfoam-master/tutorials/RAS/1DOscill/constant/gammaDot.xy
 -0.049375       8000
 -0.048125          0
 -0.046875          0
 -0.045625          0
 -0.044375          0
 -0.043125          0
 -0.041875          0
 -0.040625          0
 -0.039375          0
 -0.038125          0
 -0.036875          0
 -0.035625          0
 -0.034375          0
 -0.033125          0
 -0.031875          0
 -0.030625          0
 -0.029375          0
 -0.028125          0
 -0.026875          0
 -0.025625          0
 -0.024375          0
 -0.023125          0
 -0.021875          0
 -0.020625          0
 -0.019375          0
 -0.018125          0
 -0.016875          0
 -0.015625          0
 -0.014375          0
 -0.013125          0
 -0.011875          0
 -0.010625          0
 -0.009375          0
 -0.008125          0
 -0.006875          0
 -0.005625          0
 -0.004375          0
 -0.003125          0
 -0.001875          0
 -0.000625          0
  0.000625          0
  0.001875          0
  0.003125          0
  0.004375          0
  0.005625          0
  0.006875          0
  0.008125          0
  0.009375          0
  0.010625          0
  0.011875          0
  0.013125          0
  0.014375          0
  0.015625          0
  0.016875          0
  0.018125          0
  0.019375          0
  0.020625          0
  0.021875          0
  0.023125          0
  0.024375          0
  0.025625          0
  0.026875          0
  0.028125          0
  0.029375          0
  0.030625          0
  0.031875          0
  0.033125          0
  0.034375          0
  0.035625          0
  0.036875          0
  0.038125          0
  0.039375          0
  0.040625          0
  0.041875          0
  0.043125          0
  0.044375          0
  0.045625          0
  0.046875          0
  0.048125          0
  0.049375       8000
